1.8.xx/package/tau_modules/app_tr069/src/sample/get_l2tp.xml

<soap:Envelope 
			soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" 
			xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
			xmlns:cwmp="urn:dslforum-org:cwmp-1-0" 
			xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Header>
    <cwmp:ID soap:mustUnderstand="1">3D8D198B69F94D7BB2A9266408481BE9</cwmp:ID>
  </soap:Header>
  <soap:Body>
	<cwmp:GetParameterValues>
      <ParameterNames soapenc:arrayType="xsd:string[1]">
	 <string>InternetGatewayDevice.X_PPPoE2L2TP.Enable</string>
	<string>InternetGatewayDevice.X_PPPoE2L2TP.MTUOfUser</string>
	<string>InternetGatewayDevice.X_PPPoE2L2TP.L2TPServerNumberOfEntries</string>
 <string>InternetGatewayDevice.X_PPPoE2L2TP.L2TPServer.1.Device </string>
	 <string>InternetGatewayDevice.X_PPPoE2L2TP.L2TPServer.2.TunnelMode</string>
	 <string>InternetGatewayDevice.X_PPPoE2L2TP.L2TPServer.1.LNSServerIPAddress</string>
	 <string>InternetGatewayDevice.X_PPPoE2L2TP.L2TPServer.2.LNSServerHostName</string>
	 <string>InternetGatewayDevice.X_PPPoE2L2TP.L2TPServer.2.LNSServerPortName</string>
	 <string>InternetGatewayDevice.X_PPPoE2L2TP.L2TPServer.1.TunnelAuthenticateEnable</string>
	 <string>InternetGatewayDevice.X_PPPoE2L2TP.L2TPServer.2.PasswordOfTunnel</string>
	</ParameterNames>
      </cwmp:GetParameterValues>
  </soap:Body>
</soap:Envelope>
